--------------------------------------------------------------------------------------------------------------------
       log:  C:\Incentives_Matter_Data\Incentives_FINAL\Log Files\Table9_Mid.log
  log type:  text
 opened on:   1 Jun 2011, 14:15:25

. cd "C:\Incentives_Matter_Data\Incentives_FINAL\Raw Data\Tests";
C:\Incentives_Matter_Data\Incentives_FINAL\Raw Data\Tests

. set more off;

. set mem 400m;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory          400M    max. data space                400.000M
    set matsize         500     max. RHS vars in models          1.949M
                                                            -----------
                                                               403.858M

. set matsize 500;

Current memory allocation

                    current                                 memory usage
    settable          value     description                 (1M = 1024k)
    --------------------------------------------------------------------
    set maxvar         5000     max. variables allowed           1.909M
    set memory          400M    max. data space                400.000M
    set matsize         500     max. RHS vars in models          1.949M
                                                            -----------
                                                               403.858M

. ******************************************************************************************************************
> ;
. **Closed School data;
. ******************************************************************************************************************
> ;
. use "Closed School.dta";

. gen close=1 if mon10=="Closed" &  mon11=="Closed";
(105 missing values generated)

. gen schid=idnum;

. keep schid close;

. sort schid;

. save Temp\tempclose, replace;
file Temp\tempclose.dta saved

. ******************************************************************************************************************
> ;
. **PRE_TEST DATA;
. ******************************************************************************************************************
> ;
. *PRETEST VERBAL;
. use Baseline\pre_verbal;

. rename total_1_to_4 pre_math_v;

. rename total_5_to_11 pre_lang_v;

. rename total pre_total_v;

. gen pre_writ=0;

. keep schid childno pre_math_v pre_lang_v pre_total_v pre_writ;

. save Temp\temp1, replace;
file Temp\temp1.dta saved

. clear;

. *PRETEST WRIT;
. use Baseline\pre_written;

. rename total_1_to_4 pre_math_w;

. rename total_5_to_11 pre_lang_w;

. rename total pre_total_w;

. gen pre_writ=1;

. keep schid childno pre_math_w pre_lang_w pre_total_w pre_writ;

. save Temp\temp2, replace;
file Temp\temp2.dta saved

. clear;

. *STACK PRETEST;
. use Temp\temp1;

. append using Temp\temp2;

. sort schid childno;

. save Temp\testdata, replace;
file Temp\testdata.dta saved

. clear;

. ******************************************************************************************************************
> ;
. **MID TEST DATA;
. ******************************************************************************************************************
> ;
. use Midline\mid_verbal;

. rename tot_1_to_4 mid_math_v;

. rename tot_5_to_11 mid_lang_v;

. rename total mid_total_v;

. keep schid childno mid_math_v mid_lang_v mid_total_v;

. replace schid=2492 if schid==2493;
(4 real changes made)

. sort schid childno;

. save Temp\temp3, replace;
file Temp\temp3.dta saved

. clear;

. *MIDTEST WRIT;
. use Midline\mid_written;

. rename total_1_to_5 mid_math_w;

. rename total_6_to_16 mid_lang_w;

. rename total mid_total_w;

. gen mid_writ=1;

. keep schid childno mid_math_w mid_lang_w mid_total_w mid_writ;

. replace schid=2492 if schid==2493;
(2 real changes made)

. sort schid childno;

. save Temp\temp4, replace;
file Temp\temp4.dta saved

. clear;

. *MERGE POST TEST;
. use Temp\temp3;

. sort schid childno;

. merge schid childno using Temp\temp4;

. drop _merge;

. ******************************************************************************************************************
> ;
. **MERGING PRE AND MID TEST;
. ******************************************************************************************************************
> ;
. sort schid childno;

. merge schid childno using Temp\testdata;
variables schid childno do not uniquely identify observations in Temp\testdata.dta

. save Temp\testdata, replace;
file Temp\testdata.dta saved

. **FIXING MISTAKES IN THE DATA;
. replace pre_math_w=56 if schid==4231 & childno==3;
(1 real change made)

. replace pre_total_v=11 if schid==3511 & childno==17;
(1 real change made)

. replace pre_total_w=34 if schid==4252 & childno==22;
(1 real change made)

. gen block = int(schid/1000);

. *MERGING IN TREATMENT STATUS;
. drop _merge;

. sort schid;

. merge schid using treatschool;
variable schid does not uniquely identify observations in the master data

. gen treat = 0;

. replace treat = 1 if _merge == 3;
(1546 real changes made)

. **RECODING VARIABLES;
. for var _all: replace X = . if X == -999;

->  replace schid = . if schid == -999
(0 real changes made)

->  replace childno = . if childno == -999
(0 real changes made)

->  replace mid_math_v = . if mid_math_v == -999
(0 real changes made)

->  replace mid_lang_v = . if mid_lang_v == -999
(0 real changes made)

->  replace mid_total_v = . if mid_total_v == -999
(0 real changes made)

->  replace mid_math_w = . if mid_math_w == -999
(0 real changes made)

->  replace mid_lang_w = . if mid_lang_w == -999
(0 real changes made)

->  replace mid_total_w = . if mid_total_w == -999
(0 real changes made)

->  replace mid_writ = . if mid_writ == -999
(0 real changes made)

->  replace pre_total_v = . if pre_total_v == -999
(96 real changes made, 96 to missing)

->  replace pre_math_v = . if pre_math_v == -999
(99 real changes made, 99 to missing)

->  replace pre_lang_v = . if pre_lang_v == -999
(196 real changes made, 196 to missing)

->  replace pre_writ = . if pre_writ == -999
(0 real changes made)

->  replace pre_total_w = . if pre_total_w == -999
(0 real changes made)

->  replace pre_math_w = . if pre_math_w == -999
(0 real changes made)

->  replace pre_lang_w = . if pre_lang_w == -999
(1 real change made, 1 to missing)

->  replace block = . if block == -999
(0 real changes made)

->  replace _merge = . if _merge == -999
(0 real changes made)

->  replace treat = . if treat == -999
(0 real changes made)

. for var _all: replace X = . if X == -888;

->  replace schid = . if schid == -888
(0 real changes made)

->  replace childno = . if childno == -888
(0 real changes made)

->  replace mid_math_v = . if mid_math_v == -888
(0 real changes made)

->  replace mid_lang_v = . if mid_lang_v == -888
(0 real changes made)

->  replace mid_total_v = . if mid_total_v == -888
(0 real changes made)

->  replace mid_math_w = . if mid_math_w == -888
(0 real changes made)

->  replace mid_lang_w = . if mid_lang_w == -888
(0 real changes made)

->  replace mid_total_w = . if mid_total_w == -888
(0 real changes made)

->  replace mid_writ = . if mid_writ == -888
(0 real changes made)

->  replace pre_total_v = . if pre_total_v == -888
(2 real changes made, 2 to missing)

->  replace pre_math_v = . if pre_math_v == -888
(2 real changes made, 2 to missing)

->  replace pre_lang_v = . if pre_lang_v == -888
(2 real changes made, 2 to missing)

->  replace pre_writ = . if pre_writ == -888
(0 real changes made)

->  replace pre_total_w = . if pre_total_w == -888
(0 real changes made)

->  replace pre_math_w = . if pre_math_w == -888
(0 real changes made)

->  replace pre_lang_w = . if pre_lang_w == -888
(0 real changes made)

->  replace block = . if block == -888
(0 real changes made)

->  replace _merge = . if _merge == -888
(0 real changes made)

->  replace treat = . if treat == -888
(0 real changes made)

. for var _all: replace X = . if X == -777;

->  replace schid = . if schid == -777
(0 real changes made)

->  replace childno = . if childno == -777
(0 real changes made)

->  replace mid_math_v = . if mid_math_v == -777
(0 real changes made)

->  replace mid_lang_v = . if mid_lang_v == -777
(0 real changes made)

->  replace mid_total_v = . if mid_total_v == -777
(0 real changes made)

->  replace mid_math_w = . if mid_math_w == -777
(0 real changes made)

->  replace mid_lang_w = . if mid_lang_w == -777
(0 real changes made)

->  replace mid_total_w = . if mid_total_w == -777
(0 real changes made)

->  replace mid_writ = . if mid_writ == -777
(0 real changes made)

->  replace pre_total_v = . if pre_total_v == -777
(6 real changes made, 6 to missing)

->  replace pre_math_v = . if pre_math_v == -777
(6 real changes made, 6 to missing)

->  replace pre_lang_v = . if pre_lang_v == -777
(6 real changes made, 6 to missing)

->  replace pre_writ = . if pre_writ == -777
(0 real changes made)

->  replace pre_total_w = . if pre_total_w == -777
(0 real changes made)

->  replace pre_math_w = . if pre_math_w == -777
(0 real changes made)

->  replace pre_lang_w = . if pre_lang_w == -777
(0 real changes made)

->  replace block = . if block == -777
(0 real changes made)

->  replace _merge = . if _merge == -777
(0 real changes made)

->  replace treat = . if treat == -777
(0 real changes made)

. **MERGING IN CLOSURE STATUS;
. drop _merge;

. sort schid;

. merge schid using Temp/tempclose;
variable schid does not uniquely identify observations in the master data

. drop if treat==.;
(5 observations deleted)

. save Temp\test_new.dta, replace;
file Temp\test_new.dta saved

. ******************************************************************************************************************
> ;
. **SOME SAMPLE STATS;
. ******************************************************************************************************************
> ;
. **CALC SCORES BY SCHID AND LOOKING AT CLOSURES;
. sort schid close treat;

. collapse (mean) pre_math_v pre_lang_v pre_total_v pre_math_w pre_lang_w pre_total_w 
> mid_math_v mid_lang_v mid_total_v mid_math_w mid_lang_w mid_total_w, by(schid close treat);

. clear;

. **STUDENT LEVEL DATA;
. use Temp\test_new.dta;

. **DROPING SCHOOLS WITH NO PRE OR POST DATA THAT WERE BASICALLY NEVER OPEN;
. drop if schid==1211;
(1 observation deleted)

. drop if schid==5332;
(1 observation deleted)

. drop if schid==5711;
(1 observation deleted)

. drop if schid==1111;
(0 observations deleted)

. drop if schid==2111;
(0 observations deleted)

. drop if schid==5221;
(0 observations deleted)

. drop if schid==5611;
(0 observations deleted)

. drop if schid==1113;
(11 observations deleted)

. drop if schid==5731 & childno==24;
(2 observations deleted)

. **drop if close==1;
. save Temp\test_new.dta, replace;
file Temp\test_new.dta saved

. *LOOKING AT ENTRY AND EXIT;
. gen entry=0;

. replace entry=1 if (pre_total_v==. & pre_total_w==.) & mid_total_v!=. ;
(760 real changes made)

. gen missing=0;

. replace missing=1 if (pre_total_v!=. | pre_total_w!=.) & mid_total_v==. ;
(371 real changes made)

. gen stayer=0;

. replace stayer=1 if missing==0 & entry==0;
(1893 real changes made)

. tab entry;

      entry |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,264       74.87       74.87
          1 |        760       25.13      100.00
------------+-----------------------------------
      Total |      3,024      100.00

. tab missing;

    missing |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,653       87.73       87.73
          1 |        371       12.27      100.00
------------+-----------------------------------
      Total |      3,024      100.00

. tab stayer;

     stayer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,131       37.40       37.40
          1 |      1,893       62.60      100.00
------------+-----------------------------------
      Total |      3,024      100.00

. **drop if close==1;
. save Temp\test_new, replace;
file Temp\test_new.dta saved

. ******************************************************************************************************************
> ;
. **ADDING SCORES;
. ******************************************************************************************************************
> ;
. drop if stayer==0;
(1131 observations deleted)

. replace pre_math_w=pre_math_w/5;
(343 real changes made)

. replace pre_lang_w=pre_lang_w/5;
(336 real changes made)

. replace pre_total_w=pre_total_w/5;
(343 real changes made)

. replace mid_math_w=mid_math_w/5;
(659 real changes made)

. replace mid_lang_w=mid_lang_w/5;
(652 real changes made)

. replace mid_total_w=mid_total_w/5;
(661 real changes made)

. replace pre_math_v=0 if pre_math_v==.;
(378 real changes made)

. replace pre_lang_v=0 if pre_lang_v==.;
(455 real changes made)

. replace pre_total_v=0 if pre_total_v==.;
(377 real changes made)

. replace pre_math_w=0 if pre_math_w==.;
(1550 real changes made)

. replace pre_lang_w=0 if pre_lang_w==.;
(1551 real changes made)

. replace pre_total_w=0 if pre_total_w==.;
(1550 real changes made)

. replace mid_math_v=0 if mid_math_v==.;
(34 real changes made)

. replace mid_lang_v=0 if mid_lang_v==.;
(34 real changes made)

. replace mid_total_v=0 if mid_total_v==.;
(34 real changes made)

. replace mid_math_w=0 if mid_math_w==.;
(1232 real changes made)

. replace mid_lang_w=0 if mid_lang_w==.;
(1232 real changes made)

. replace mid_total_w=0 if mid_total_w==.;
(1232 real changes made)

. gen add_mid_math=mid_math_v+mid_math_w;

. gen add_mid_lang=mid_lang_v+mid_lang_w;

. gen add_mid_total=mid_total_v+mid_total_w;

. ******************************************************************************************************************
> ;
. **Normalized scores (PANEL A & B & C);
. ******************************************************************************************************************
> ;
. program define zscore;
  1.         syntax, option1(string);
  2. sort treat;
  3. egen m1_`option1'=mean(`option1') if treat==0;
  4. egen sd1_`option1'=sd(`option1') if treat==0;
  5. egen m_`option1'=mean(m1_`option1');
  6. egen sd_`option1'=mean(sd1_`option1');
  7. gen z_`option1'=(`option1'-m_`option1')/sd_`option1';
  8. end;

. zscore, option1(add_mid_math);
(1015 missing values generated)
(1015 missing values generated)

. zscore, option1(add_mid_lang);
(1015 missing values generated)
(1015 missing values generated)

. zscore, option1(add_mid_total);
(1015 missing values generated)
(1015 missing values generated)

. replace mid_writ=0 if mid_writ==.;
(1232 real changes made)

. **PANEL A;
. regress mid_writ treat pre_math_v pre_math_w pre_writ, cluster(schid);

Linear regression                                      Number of obs =    1893
                                                       F(  4,   112) =  501.36
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3509
                                                       Root MSE      =  .38458

                                (Std. Err. adjusted for 113 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
    mid_writ |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0422114   .0289819     1.46   0.148    -.0152124    .0996353
  pre_math_v |   .0319148   .0028928    11.03   0.000     .0261831    .0376465
  pre_math_w |   .0212143   .0074486     2.85   0.005     .0064559    .0359727
    pre_writ |   .7562548   .0733826    10.31   0.000     .6108567    .9016529
       _cons |  -.0461353   .0218488    -2.11   0.037    -.0894258   -.0028448
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9A_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket replace;

. regress z_add_mid_math treat pre_math_v pre_math_w pre_writ, cluster(schid);

Linear regression                                      Number of obs =    1893
                                                       F(  4,   112) =  210.14
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4431
                                                       Root MSE      =   .7686

                                (Std. Err. adjusted for 113 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~h |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .1534675   .0699557     2.19   0.030     .0148592    .2920758
  pre_math_v |   .1122294   .0071785    15.63   0.000     .0980062    .1264526
  pre_math_w |   .1181715   .0167967     7.04   0.000     .0848911    .1514519
    pre_writ |   1.381095   .1581168     8.73   0.000     1.067807    1.694383
       _cons |  -1.154013    .078031   -14.79   0.000    -1.308622   -.9994048
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9A_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket append;

. regress z_add_mid_lang treat pre_lang_v pre_lang_w pre_writ, cluster(schid);

Linear regression                                      Number of obs =    1893
                                                       F(  4,   112) =  342.18
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5957
                                                       Root MSE      =  .65449

                                (Std. Err. adjusted for 113 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |    .160203   .0604041     2.65   0.009     .0405201    .2798859
  pre_lang_v |   .1486662   .0058795    25.29   0.000     .1370167    .1603157
  pre_lang_w |   .1146471   .0179639     6.38   0.000     .0790539    .1502403
    pre_writ |    1.66521   .0895554    18.59   0.000     1.487767    1.842653
       _cons |  -.8174446   .0453366   -18.03   0.000    -.9072732    -.727616
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9A_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket append;

. regress z_add_mid_total treat pre_total_v pre_total_w pre_writ, cluster(schid);

Linear regression                                      Number of obs =    1893
                                                       F(  4,   112) =  209.00
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.5646
                                                       Root MSE      =  .68115

                                (Std. Err. adjusted for 113 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .1718042   .0620562     2.77   0.007     .0488477    .2947607
 pre_total_v |   .0763947   .0114894     6.65   0.000       .05363    .0991595
 pre_total_w |   .0668776   .0098204     6.81   0.000     .0474197    .0863355
    pre_writ |   1.653771    .183915     8.99   0.000     1.289367    2.018175
       _cons |   -1.17007   .1245778    -9.39   0.000    -1.416904   -.9232347
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9A_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket append;

. **PANEL C;
. regress z_add_mid_math treat pre_math_v pre_math_w if pre_writ==0, cluster(schid);

Linear regression                                      Number of obs =    1550
                                                       F(  2,   112) =  122.28
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1883
                                                       Root MSE      =  .78845

                                (Std. Err. adjusted for 113 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~h |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .1446861   .0761556     1.90   0.060    -.0062065    .2955788
  pre_math_v |   .1122215   .0071762    15.64   0.000     .0980028    .1264401
  pre_math_w |  (dropped)
       _cons |  -1.149192   .0805138   -14.27   0.000     -1.30872   -.9896646
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9C_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket replace;

. regress z_add_mid_lang treat pre_lang_v pre_lang_w if pre_writ==0, cluster(schid);

Linear regression                                      Number of obs =    1550
                                                       F(  2,   112) =  335.47
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.4179
                                                       Root MSE      =  .65871

                                (Std. Err. adjusted for 113 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .1327844   .0623924     2.13   0.036     .0091618    .2564069
  pre_lang_v |   .1486829   .0058873    25.25   0.000     .1370179    .1603478
  pre_lang_w |  (dropped)
       _cons |  -.8026442   .0461232   -17.40   0.000    -.8940313   -.7112571
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9C_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket append;

. regress z_add_mid_total treat pre_total_v pre_total_w if pre_writ==0, cluster(schid);

Linear regression                                      Number of obs =    1550
                                                       F(  2,   112) =   28.83
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.3469
                                                       Root MSE      =  .69165

                                (Std. Err. adjusted for 113 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |    .154733   .0661495     2.34   0.021     .0236662    .2857997
 pre_total_v |   .0763808   .0115003     6.64   0.000     .0535943    .0991672
 pre_total_w |  (dropped)
       _cons |   -1.16066   .1252017    -9.27   0.000    -1.408731   -.9125887
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9C_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket append;

. **PANEL D;
. regress z_add_mid_math treat pre_math_v pre_math_w if pre_writ==1, cluster(schid);

Linear regression                                      Number of obs =     343
                                                       F(  2,    64) =   29.06
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1967
                                                       Root MSE      =  .67184

                                 (Std. Err. adjusted for 65 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~h |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .1936676   .1208403     1.60   0.114    -.0477387     .435074
  pre_math_v |  (dropped)
  pre_math_w |     .11709   .0174109     6.73   0.000     .0823078    .1518722
       _cons |   .2156444   .1555342     1.39   0.170    -.0950709    .5263597
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9D_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket replace;

. regress z_add_mid_lang treat pre_lang_v pre_lang_w if pre_writ==1, cluster(schid);

Linear regression                                      Number of obs =     343
                                                       F(  2,    64) =   22.52
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.1875
                                                       Root MSE      =  .63225

                                 (Std. Err. adjusted for 65 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~g |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |    .283386   .1143285     2.48   0.016     .0549886    .5117833
  pre_lang_v |  (dropped)
  pre_lang_w |   .1138784   .0185488     6.14   0.000      .076823    .1509338
       _cons |    .787722   .0999292     7.88   0.000     .5880905    .9873535
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9D_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket append;

. regress z_add_mid_total treat pre_total_v pre_total_w if pre_writ==1, cluster(schid);

Linear regression                                      Number of obs =     343
                                                       F(  2,    64) =   26.56
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.2208
                                                       Root MSE      =  .63082

                                 (Std. Err. adjusted for 65 clusters in schid)
------------------------------------------------------------------------------
             |               Robust
z_add_mid_~l |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .2489905   .1131063     2.20   0.031     .0230347    .4749463
 pre_total_v |  (dropped)
 pre_total_w |   .0661513   .0101271     6.53   0.000     .0459202    .0863824
       _cons |   .4530362   .1361358     3.33   0.001     .1810737    .7249987
------------------------------------------------------------------------------

. outreg treat using "C:\Incentives_Matter_Data\Incentives_FINAL\Output\Table9D_mid.csv", bdec(2) nocons se 3aster r
> dec(2) comma bracket append;

. 
end of do-file

. do "C:\Incentives_Matter_Data\Incentives_FINAL\Programs\Table 9 Post.do"

. clear 

. 
. *SETTING ENVIRONMENT;
. #delimit;
delimiter now ;
. capture log close;
